app/views/depts/_form.html.erb

SELECT "depts".* FROM "depts"
---
		Parent Dept:
		<%= f.select :parent_id, [["All Depts", -1]] + Dept.all.collect { |d| [d.name, d.id] } %><br>