app/views/depts/index.html.erb

			Parent Dept:
			<%= f.select :parent_id, [["All Depts", -1]] + Dept.all.collect { |d| [d.name, d.id] }, {}, { :id => 'parent_id_new' } %><br>
---
SELECT "depts".* FROM "depts"