app/controllers/depts_controller.rb

SELECT "depts".* FROM "depts" WHERE "depts"."id" = ? LIMIT 1  [["id", "4"]]
---
  def show
    @dept = Dept.find(params[:id])

SELECT "depts".* FROM "depts" WHERE "depts"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @dept = Dept.find(params[:id])

INSERT INTO "depts" ("created_at", "name", "parent_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 15 Jan 2012 04:11:44 UTC +00:00], ["name", "dept4"], ["parent_id", 3], ["updated_at", Sun, 15 Jan 2012 04:11:44 UTC +00:00]]
---
  def create
    @dept = Dept.new(params[:dept])

    respond_to do |format|
      if @dept.save

SELECT "depts".* FROM "depts" WHERE "depts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "depts" SET "name" = 'dept_3', "parent_id" = NULL, "updated_at" = '2012-01-15 05:48:41.104478' WHERE "depts"."id" = 3
---
  def update
    @dept = Dept.find(params[:id])

    respond_to do |format|
      if @dept.update_attributes(params[:dept])

SELECT "depts".* FROM "depts" WHERE "depts"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "depts" WHERE "depts"."id" = ?  [["id", 4]]
---
  def destroy
    @dept = Dept.find(params[:id])
    @dept.destroy