app/controllers/humen_controller.rb

  def find_humen
    dept_id = params[:dept_id] || "-1"
    offset = params[:iDisplayStart] || 0
    limit = params[:iDisplayLength] || -1
    filter_cond = Settings.filters[params[:filter]] || {}

    begin
      dept = Dept.find(dept_id)
---
SELECT "depts".* FROM "depts" WHERE "depts"."id" = ? LIMIT 1  [["id", "35"]]